<details ><summary>apply for oracle-fundaztic 2025-08-19 14:01:14 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#oracle-fundaztic has been locked by PR #12
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # oci_core_instance.fundaztic_instance will be created
  + resource "oci_core_instance" "fundaztic_instance" {
      + availability_domain                 = "TFVD:AP-SINGAPORE-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaawutq5bmyehb2obqa3hcvstm5gzmboh62p7ixwwhdvgz2r73kvynq"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "fundaztic-instance"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "user_data" = "IyEvYmluL2Jhc2gKc2V0IC1lCgojIEluc3RhbGwgRG9ja2VyCnl1bSB1cGRhdGUgLXkKeXVtIGluc3RhbGwgLXkgZG9ja2VyCnN5c3RlbWN0bCBlbmFibGUgZG9ja2VyCnN5c3RlbWN0bCBzdGFydCBkb2NrZXIKCiMgSW5zdGFsbCBPQ0kgQ0xJIChpZiBub3QgYWxyZWFkeSBpbnN0YWxsZWQpCmlmICEgY29tbWFuZCAtdiBvY2kgJj4gL2Rldi9udWxsOyB0aGVuCiAgICBiYXNoIC1jICIkKGN1cmwgLUwgaHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL29yYWNsZS9vY2ktY2xpL21hc3Rlci9zY3JpcHRzL2luc3RhbGwvaW5zdGFsbC5zaCkiIC0tIFwKICAgICAgICAtLWFjY2VwdC1hbGwtZGVmYXVsdHMKICAgIGVjaG8gImV4cG9ydCBQQVRIPVwkUEFUSDovcm9vdC9iaW4iID4+IC9yb290Ly5iYXNocmMKICAgIGV4cG9ydCBQQVRIPSRQQVRIOi9yb290L2JpbgpmaQoKIyBHZXQgT0NJUiBuYW1lc3BhY2UKTkFNRVNQQUNFPSQob2NpIG9zIG5zIGdldCAtLXF1ZXJ5IGRhdGEgLS1yYXctb3V0cHV0KQoKIyBSZWdpb24gc2hvcnQgY29kZSAocmVwbGFjZSB3aXRoIHlvdXIgcmVnaW9uLCBlLmcuIHNpbiwgaWFkLCBmcmEsIG5ydCkKUkVHSU9OX0tFWT0ic2luIgoKIyBMb2cgaW50byBPQ0lSIHVzaW5nIGluc3RhbmNlIHByaW5jaXBhbHMKb2NpIGFydGlmYWN0cyBjb250YWluZXIgbG9naW4gLS1yZWdpb24gJHtSRUdJT05fS0VZfQoKIyBPcHRpb25hbGx5IHB1bGwgeW91ciBpbWFnZXMKZG9ja2VyIHB1bGwgJHtSRUdJT05fS0VZfS5vY2lyLmlvLyR7TkFNRVNQQUNFfS9mdW5kYXp0aWMvcHJvZDpsYXRlc3QgfHwgdHJ1ZQoKIyAtLS0gUnVuIGNvbnRhaW5lciAoYWRqdXN0IGFzIG5lZWRlZCkgLS0tCmRvY2tlciBydW4gLWQgLS1uYW1lIGZ1bmRhenRpYy1jb250YWluZXIgJHtSRUdJT05fS0VZfS5vY2lyLmlvLyR7TkFNRVNQQUNFfS9mdW5kYXp0aWMvcHJvZDpsYXRlc3QKCiMgLS0tIFNldCB1cCBjcm9uam9iIHRvIHJ1biBweXRob24gc2NyaXB0IGluc2lkZSBjb250YWluZXIgZXZlcnkgaG91ciAtLS0KZWNobyAiMCAqICogKiAqIGRvY2tlciBleGVjIGZ1bmRhenRpYy1jb250YWluZXIgcHl0aG9uIC9hcHAvbXlfc2NyaXB0LnB5IiA+PiAvdmFyL3Nwb29sL2Nyb24vcm9vdAo="
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config (known after apply)

      + availability_config {
          + is_live_migration_preferred = (known after apply)
          + recovery_action             = "RESTORE_INSTANCE"
        }

      + create_vnic_details {
          + assign_ipv6ip             = false
          + assign_private_dns_record = true
          + assign_public_ip          = "false"
          + defined_tags              = (known after apply)
          + display_name              = "vnic-fundaztic"
          + freeform_tags             = (known after apply)
          + hostname_label            = (known after apply)
          + nsg_ids                   = (known after apply)
          + private_ip                = (known after apply)
          + security_attributes       = (known after apply)
          + skip_source_dest_check    = (known after apply)
          + subnet_id                 = "ocid1.subnet.oc1.ap-singapore-1.aaaaaaaaf2mg5r6mmdq3sl5uk6qtcjnvkxmm2ycc6gyvtdrdsjcgebnt7haa"
          + vlan_id                   = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = true
        }

      + launch_options (known after apply)

      + launch_volume_attachments (known after apply)

      + licensing_configs (known after apply)

      + placement_constraint_details (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 4
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
          + vcpus                         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.ap-singapore-1.aaaaaaaaqnq4vkvwbtr4k4gcmvamshtworusoi54vuwixafhg6jax7lgydta"
          + source_type             = "image"

          + instance_source_image_filter_details (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
oci_core_instance.fundaztic_instance: Creating...
oci_core_instance.fundaztic_instance: Still creating... [00m10s elapsed]
oci_core_instance.fundaztic_instance: Still creating... [00m20s elapsed]
oci_core_instance.fundaztic_instance: Still creating... [00m30s elapsed]
oci_core_instance.fundaztic_instance: Creation complete after 38s [id=ocid1.instance.oc1.ap-singapore-1.anzwsljrdia3kqic5vknpm46bg3jjix6woonblcq2c3izjzgaqrlobcezeha]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```
</details>

</details>